{
  "project": "VoteChain POC Public Demo Polish",
  "branchName": "ralph/poc-public-demo-polish",
  "description": "Complete UX/frontend refactor of the VoteChain POC harness and clients to deliver a consistent, public-ready demonstration with deterministic behavior, complete mocked operator surfaces, and verified end-to-end flows.",
  "executionPolicy": {
    "mode": "autonomous-self-evolving-backlog",
    "allowAutoGeneratedStories": true,
    "requiredScope": [
      "src/pages/votechain/poc/*",
      "src/components/votechain/poc/*"
    ],
    "requiredFactoryPromptFiles": [
      "prompts/shared-rules.md",
      "prompts/pm.md",
      "prompts/pm-facilitator.md",
      "prompts/pm-breakdown.md",
      "prompts/pm-requirements.md",
      "prompts/prd-expert.md",
      "prompts/ux.md",
      "prompts/dev-frontend.md",
      "prompts/dev-backend.md",
      "prompts/dev-infra.md",
      "prompts/qa.md",
      "prompts/security.md",
      "prompts/tech-advisor.md",
      "prompts/solutions-architect.md",
      "prompts/expert-consultation.md",
      "prompts/experts/frontend.md",
      "prompts/experts/security.md",
      "prompts/experts/observability.md"
    ],
    "completionCriteria": [
      "all stories pass=true",
      "two consecutive backlog gap scans add no new stories",
      "latest typecheck and test pass",
      "latest Playwright flow coverage passes for primary POC journeys"
    ]
  },
  "userStories": [
    {
      "id": "US-000",
      "title": "Make the POC launch page singular, polished, and public-demo ready",
      "description": "As a first-time viewer, the `/votechain/poc/` launch experience should be obvious, clean, and confidence-inspiring with no duplicated or competing actions.",
      "acceptanceCriteria": [
        "The launch page has one clear primary journey and does not present duplicate controls for the same outcome.",
        "Each launch-page section has a unique purpose; no repeated messaging blocks or redundant CTAs.",
        "Visual hierarchy is polished (headline, supporting copy, primary CTA, secondary actions) and reads as production demo quality.",
        "Primary entry actions from launch page open the expected client in modal form where applicable.",
        "Playwright smoke check validates first-load UX and primary CTA behavior."
      ],
      "priority": 1,
      "passes": true,
      "notes": "Core requirement: do one thing, do it once, do it well."
    },
    {
      "id": "US-001",
      "title": "Unify POC visual system across all routes",
      "description": "As a public demo viewer, I need every POC page to feel like one product rather than disconnected screens.",
      "acceptanceCriteria": [
        "All `/votechain/poc/*` pages use shared visual tokens for spacing, typography, borders, states, and action hierarchy.",
        "Top harness bar, client switcher, and section framing are consistent across `/votechain/poc/`, `/votechain/poc/vote`, `/votechain/poc/setup`, `/votechain/poc/verify`, `/votechain/poc/lookup`, `/votechain/poc/monitor`, `/votechain/poc/dashboard`, and `/votechain/poc/trust`.",
        "No route contains conflicting legacy header or duplicated nav blocks that break visual continuity.",
        "`npm run typecheck` passes.",
        "`npm run test` passes."
      ],
      "priority": 1,
      "passes": true,
      "notes": "This is the baseline style pass before feature polishing."
    },
    {
      "id": "US-002",
      "title": "Make the harness the single orchestration shell",
      "description": "As an operator, I need one harness that can launch and coordinate every client role in the POC.",
      "acceptanceCriteria": [
        "Harness exposes role-based entry points for Voting (iPad), Admin, Same-Day Registration, Board Audit, Receipt Verify, Monitor, Reveal/Tally, and Trust.",
        "Each entry point has a clear role label and purpose copy.",
        "All harness client buttons open their target client in a modal overlay from any harness page (including Voting iPad, Admin, Same-Day Registration, Board Audit, Receipt Verify, Monitor, Reveal/Tally, and Trust).",
        "No harness client action performs an unexpected full-page navigation when clicked from the harness.",
        "Focus-mode-only controls are removed from the top bar.",
        "Navigation does not break browser back/forward behavior.",
        "`npm run typecheck` passes."
      ],
      "priority": 2,
      "passes": true,
      "notes": "Harness should be usable as a demo control room."
    },
    {
      "id": "US-003",
      "title": "Isolate Voting iPad client as reusable component",
      "description": "As an engineer, I need the voting kiosk to be a standalone component imported into modal shells without route-specific duplication.",
      "acceptanceCriteria": [
        "Voting client UI and behavior live in a dedicated reusable component.",
        "Modal host imports that component and handles open/close/focus/escape/backdrop semantics.",
        "No duplicate voting business logic remains scattered across route pages.",
        "Opening voting modal from any harness route renders the full iPad frame + client content reliably.",
        "`npm run typecheck` passes."
      ],
      "priority": 3,
      "passes": true,
      "notes": "This enforces maintainable architecture."
    },
    {
      "id": "US-004",
      "title": "Enforce kiosk viewport fit with zero vertical scrolling",
      "description": "As a poll worker, I should never need to scroll inside the iPad client to complete required actions.",
      "acceptanceCriteria": [
        "In kiosk/focus/modal mode, required controls for each active step are fully visible within the iPad screen cutout.",
        "Primary step containers and action footer do not require vertical scroll to proceed.",
        "No required action is clipped below viewport for standard desktop and tablet viewport sizes used in demo.",
        "Overflow behavior is intentional; non-essential detail content is collapsed or moved out of kiosk body.",
        "Playwright verification captures screenshots for each step proving viewport fit."
      ],
      "priority": 4,
      "passes": true,
      "notes": "This is a hard kiosk UX requirement."
    },
    {
      "id": "US-005",
      "title": "Fix voter session lifecycle and Done behavior",
      "description": "As poll staff, I need Done to reset for the next voter while preserving duplicate-vote protections.",
      "acceptanceCriteria": [
        "After successful cast, clicking Done returns to Step 1 in an unverified state for a fresh voter session.",
        "Re-opening the voting modal does not show prior voter as pre-verified.",
        "If the previous credential already cast, repeat cast attempt fails with explicit duplicate-vote messaging.",
        "If election is reset or new voter session is created, voting proceeds normally.",
        "Session reset behavior is deterministic across modal close/open cycles."
      ],
      "priority": 5,
      "passes": true,
      "notes": "This addresses trust-breaking UX regressions."
    },
    {
      "id": "US-006",
      "title": "Standardize stepper and action semantics",
      "description": "As a user, I need predictable Back/Continue/Restart behavior and status language across all workflows.",
      "acceptanceCriteria": [
        "Wizard controls have consistent placement, labels, and disable/loading states.",
        "Step status text is concise, task-relevant, and non-contradictory.",
        "Progress indicators reflect true completion state and do not overstate readiness.",
        "Error paths return users to a clear recovery action without dead ends."
      ],
      "priority": 6,
      "passes": true,
      "notes": "Reduce cognitive load and accidental mistakes."
    },
    {
      "id": "US-007",
      "title": "Improve empty/loading/error states across POC routes",
      "description": "As a demo audience member, I need understandable state transitions instead of abrupt blanks or technical confusion.",
      "acceptanceCriteria": [
        "Setup, verify, lookup, monitor, dashboard, and trust routes each have explicit empty/loading/success/error states.",
        "Async actions show visible progress and prevent duplicate submissions.",
        "Error messages include user action guidance and expected next step.",
        "No major route leaves stale data visible after reset events."
      ],
      "priority": 7,
      "passes": true,
      "notes": "Public demos fail fast on state ambiguity."
    },
    {
      "id": "US-008",
      "title": "Ship accessibility baseline for public demo",
      "description": "As a public user, I need keyboard and assistive-tech-usable interactions.",
      "acceptanceCriteria": [
        "All interactive controls have accessible names and visible focus states.",
        "Modal is keyboard-trappable and closes via Escape/backdrop with focus restoration.",
        "Color contrast for key text and controls meets WCAG AA expectations.",
        "Heading hierarchy and landmark structure are coherent across `/votechain/poc/*`.",
        "No obvious keyboard-only dead ends in primary demo flow."
      ],
      "priority": 8,
      "passes": true,
      "notes": "Must be good enough for public consumption."
    },
    {
      "id": "US-009",
      "title": "Polish content and microcopy for credibility",
      "description": "As an external stakeholder, I need clear concise language that reads as production-grade, not placeholder copy.",
      "acceptanceCriteria": [
        "Client labels and route subtitles use consistent vocabulary across harness and pages.",
        "Step instructions are concise and action-oriented.",
        "Technical details remain available but are visually secondary in kiosk mode.",
        "No contradictory labels (e.g., active vs complete vs pending) on the same state."
      ],
      "priority": 9,
      "passes": true,
      "notes": "Tone should be enterprise/demo polished."
    },
    {
      "id": "US-010",
      "title": "Complete mocked operator surfaces for all lifecycle roles",
      "description": "As a product reviewer, I need practical mock workflows for pre-vote, in-vote, and post-vote operations.",
      "acceptanceCriteria": [
        "Admin + Same-Day Registration route supports clear setup and intake workflow framing.",
        "Board Audit and Receipt Verify provide actionable verification interfaces tied to receipt/ballot artifacts.",
        "Monitor shows health/drift/fraud telemetry with interpretable status.",
        "Reveal/Tally and Trust routes present post-close operations and independent verification narratives.",
        "Harness links make each role discoverable in one click."
      ],
      "priority": 10,
      "passes": false,
      "notes": "The harness should demonstrate full election lifecycle coverage."
    },
    {
      "id": "US-011",
      "title": "Responsive and cross-viewport robustness",
      "description": "As a presenter, I need the demo to hold up across laptop and large-display contexts without layout breakage.",
      "acceptanceCriteria": [
        "Core harness and client layouts are stable on common desktop widths and tablet-like widths.",
        "No critical overlap, clipped controls, or impossible-to-click actions in key routes.",
        "Modal and page-level scrolling are intentionally controlled and non-conflicting."
      ],
      "priority": 11,
      "passes": false,
      "notes": "Prioritize presentation environments."
    },
    {
      "id": "US-012",
      "title": "Add deterministic Playwright coverage for key demo journeys",
      "description": "As an engineering lead, I need automation proving the polished flows actually work.",
      "acceptanceCriteria": [
        "Playwright walkthrough validates cast flow through successful receipt generation in modal iPad client.",
        "Playwright validates Done resets to fresh unverified session.",
        "Playwright validates duplicate-vote attempt failure messaging when reusing prior credential context.",
        "Playwright validates navigation to verify, lookup, dashboard, monitor, and trust routes from harness.",
        "Artifacts (screenshots/logs) are captured under existing project artifact conventions."
      ],
      "priority": 12,
      "passes": false,
      "notes": "Automation is mandatory for regression confidence."
    },
    {
      "id": "US-013",
      "title": "Route-wide code quality gate for POC scope",
      "description": "As release owner, I need confidence that POC changes are type-safe and behaviorally stable.",
      "acceptanceCriteria": [
        "`npm run typecheck` passes after all POC work.",
        "`npm run test` passes after all POC work.",
        "No unresolved runtime console errors in primary harness + voting flow."
      ],
      "priority": 13,
      "passes": false,
      "notes": "Core quality gate before public demo signoff."
    },
    {
      "id": "US-014",
      "title": "Final public-demo signoff across all /votechain/poc routes",
      "description": "As the product owner, I need explicit proof that every POC route was improved and validated.",
      "acceptanceCriteria": [
        "All route files under `src/pages/votechain/poc/*` were reviewed and improved where needed for consistency and usability.",
        "Shared POC components under `src/components/votechain/poc/*` were aligned with final interaction model.",
        "Verification checklist completed for routes: `/votechain/poc/`, `/votechain/poc/vote`, `/votechain/poc/setup`, `/votechain/poc/verify`, `/votechain/poc/lookup`, `/votechain/poc/monitor`, `/votechain/poc/dashboard`, `/votechain/poc/trust`.",
        "Playwright and code checks are documented in `scripts/ralph/progress.txt` with pass/fail outcomes and follow-up actions."
      ],
      "priority": 14,
      "passes": false,
      "notes": "This is the formal completion gate."
    }
  ]
}
